''' Определение класса с помощью type() '''
# a = 5 # в этом случа указывает на переменную типа 'itn'
# print(type(a))
# a = "hello world" # в этом случа указывает на переменную типа 'str'
# print(type(a))
# a = 42.0 * 3.141592 / 2.71828 # в этом случа указывает на переменную типа 'float'
# print(type(a))

''' Добавим к выводу вывод id, чтобы посмотреть где находится наш объект'''
# a = 5 # в этом случа указывает на переменную типа 'itn'
# print(type(a), id(a))
# a = "hello world" # в этом случа указывает на переменную типа 'str'
# print(type(a), id(a))
# a = 42.0 * 3.141592 / 2.71828 # в этом случа указывает на переменную типа 'float'
# print(type(a), id(a))

# <class 'int'> 1308992012656
# <class 'str'> 1308997206832
# <class 'float'> 1308993050800

'''Добиваем вопрос строгой динамической типизации посмотрим на работу оператора is'''
# num = 2 + 2 * 2
# digit = 36 / 6
# print(num, digit) # видимо что и там и там выводит 6(int) и 6.0(float)
# print(num == digit) # сравниваем это одно и тоже число True
# print(num is digit) # При этом объект класса num не является объектом класса digit False

# Краткий итог в питоне всё объект, объекты лежат 
# в разных местах памяти мы можем проверять их и сравнивать не тока по значениям но и их типу

