'''Атрибуты и методы'''
# print("Hello world!".__doc__) # __doc__ - метод(это скорей атрибут) документации. Дандер метод
# print(str.__doc__)
'''Перейдем от атрибутов к настоящим методам'''
# print("Hello World!".upper()) # Метод который переводит буквы в строке в верхний регистр.
# print("Hello World!".count('l')) # Метод который подсчитывает колличество вхождений в строку выбраного элемента.
'''В питоне есть две функции которые позволяют получить инфу о атрибутах и методах'''
# Функция dir(obj) Попытается вернуть списко допустимых атрибутов для объекта.
# Функция help(obj) Если объект не указан, запускается интерактивная справочная система.
# print(dir("Hello World!"))
# help("Hello World!")
# help(str) # Покажет справочник по строке
'''Практика: Интерактивная работа со справкой, help() Ввести команду keywords ознакомится с описанием'''
# help("keywords") # описание ключевых слов для дальнейшей проверки.
# help("False") # описание булевого значение 
# help("symbols") # Покажет доступные символы и проверить что они используют 

