'''Изменяемые и неизменяемые типы'''
## Неизменяемые:
# None 
# int, bool, float, complex
# str, tuple, bytes
# set
## Изменяемые:
# list, bytearray
# frozenset
# dick

'''Возможность изменить строковый объект с помощью .replace'''
# txt = 'Hello World'
# print(txt, id(txt))
# txt = txt.replace(' ', '_')
# print(txt, id(txt))

'''Хэш - жто криптографическая 
функция хешировани, которую обычно называют хэшем и позваляет определять объект по нему'''
# x = 42
# y = 'text'
# z = 3.1415
# print(hash(x), hash(y), hash(z))
# my_list = [x, y, z]
# print(hash(my_list)) # получим ошибку, т.к. list изменяемый

'''Написать небольшую программу, которая запрашивает у пользователя любой текст и выводит о нём
следующую информацию(Тип объекта, адрес объекта в оперативной памяти и хеш объекта.)'''
# text = input("Поле для ввода: ")
# print(type(text), id(text), hash(text))

