'''Анотация типов'''
# a: int = 42 # Заменить int на float и вопросов не будет.
# b: float = float(input("Введите число: "))
# a = a / b # Питон сработает, но многие ide будут подсвечивать, что анотация не верная, потому разные типы данных.

'''Анотация типов может быть полезна в создании функций'''
# def my_func(data: list[int, float]) -> float:
# # в переменной data: ожидаем получить изменяемый список(list),
# # в нутри коллекции или списка я ожидаю получить только целые числа или числа с точкой.
# # -> float это записью после скобок, я рассчитываю получить результат вещественного типа.
#     res = sum(data) / len(data)
#     return res

# print(my_func([2, 5.5, 15, 8.0, 13.74]))

'''В питоне версии 3.10 и выше, появилась возможность использовать указать "|"(или)'''
# a: int | float = 42 # тем самым | говорим что число может быть как целое так и вещественное.
